Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/2.4.171/samv71/atdf/ATSAMV71J20.atdf
        <register caption="Global Channel Software Flush Request Register" name="XDMAC_GSWF" offset="0x40" rw="W" size="4">
          <bitfield caption="XDMAC Channel 0 Software Flush Request Bit" mask="0x00000001" name="SWF0"/>
          <bitfield caption="XDMAC Channel 1 Software Flush Request Bit" mask="0x00000002" name="SWF1"/>
          <bitfield caption="XDMAC Channel 2 Software Flush Request Bit" mask="0x00000004" name="SWF2"/>
          <bitfield caption="XDMAC Channel 3 Software Flush Request Bit" mask="0x00000008" name="SWF3"/>
          <bitfield caption="XDMAC Channel 4 Software Flush Request Bit" mask="0x00000010" name="SWF4"/>
          <bitfield caption="XDMAC Channel 5 Software Flush Request Bit" mask="0x00000020" name="SWF5"/>
          <bitfield caption="XDMAC Channel 6 Software Flush Request Bit" mask="0x00000040" name="SWF6"/>
          <bitfield caption="XDMAC Channel 7 Software Flush Request Bit" mask="0x00000080" name="SWF7"/>
          <bitfield caption="XDMAC Channel 8 Software Flush Request Bit" mask="0x00000100" name="SWF8"/>
          <bitfield caption="XDMAC Channel 9 Software Flush Request Bit" mask="0x00000200" name="SWF9"/>
          <bitfield caption="XDMAC Channel 10 Software Flush Request Bit" mask="0x00000400" name="SWF10"/>
          <bitfield caption="XDMAC Channel 11 Software Flush Request Bit" mask="0x00000800" name="SWF11"/>
          <bitfield caption="XDMAC Channel 12 Software Flush Request Bit" mask="0x00001000" name="SWF12"/>
          <bitfield caption="XDMAC Channel 13 Software Flush Request Bit" mask="0x00002000" name="SWF13"/>
          <bitfield caption="XDMAC Channel 14 Software Flush Request Bit" mask="0x00004000" name="SWF14"/>
          <bitfield caption="XDMAC Channel 15 Software Flush Request Bit" mask="0x00008000" name="SWF15"/>
          <bitfield caption="XDMAC Channel 16 Software Flush Request Bit" mask="0x00010000" name="SWF16"/>
          <bitfield caption="XDMAC Channel 17 Software Flush Request Bit" mask="0x00020000" name="SWF17"/>
          <bitfield caption="XDMAC Channel 18 Software Flush Request Bit" mask="0x00040000" name="SWF18"/>
          <bitfield caption="XDMAC Channel 19 Software Flush Request Bit" mask="0x00080000" name="SWF19"/>
          <bitfield caption="XDMAC Channel 20 Software Flush Request Bit" mask="0x00100000" name="SWF20"/>
          <bitfield caption="XDMAC Channel 21 Software Flush Request Bit" mask="0x00200000" name="SWF21"/>
          <bitfield caption="XDMAC Channel 22 Software Flush Request Bit" mask="0x00400000" name="SWF22"/>
          <bitfield caption="XDMAC Channel 23 Software Flush Request Bit" mask="0x00800000" name="SWF23"/>
        </register>
        <register-group caption="Channel Interrupt Enable Register (chid = 0)" offset="0x50" name="XDMAC_CHID" size="64" count="24" name-in-module="XDMAC_CHID"/>
        <register caption="XDMAC Version Register" name="XDMAC_VERSION" offset="0xFFC" rw="RW" size="4">
          <bitfield caption="Version of the Hardware Module" mask="0x00000FFF" name="VERSION"/>
          <bitfield caption="Metal Fix Number" mask="0x00070000" name="MFN"/>
        </register>
      </register-group>
      <value-group caption="" name="XDMAC_CNDC0__NDE">
        <value caption="Descriptor fetch is disabled." name="DSCR_FETCH_DIS" value="0"/>
        <value caption="Descriptor fetch is enabled." name="DSCR_FETCH_EN" value="1"/>
      </value-group>
      <value-group caption="" name="XDMAC_CNDC0__NDSUP">
        <value caption="Source parameters remain unchanged." name="SRC_PARAMS_UNCHANGED" value="0"/>
        <value caption="Source parameters are updated when the descriptor is retrieved." name="SRC_PARAMS_UPDATED" value="1"/>
      </value-group>
      <value-group caption="" name="XDMAC_CNDC0__NDDUP">
        <value caption="Destination parameters remain unchanged." name="DST_PARAMS_UNCHANGED" value="0"/>
        <value caption="Destination parameters are updated when the descriptor is retrieved." name="DST_PARAMS_UPDATED" value="1"/>
      </value-group>
      <value-group caption="" name="XDMAC_CNDC0__NDVIEW">
        <value caption="Next Descriptor View 0" name="NDV0" value="0x0"/>
        <value caption="Next Descriptor View 1" name="NDV1" value="0x1"/>
        <value caption="Next Descriptor View 2" name="NDV2" value="0x2"/>
        <value caption="Next Descriptor View 3" name="NDV3" value="0x3"/>
      </value-group>
      <value-group caption="" name="XDMAC_CC0__TYPE">
        <value caption="Self-triggered mode (memory-to-memory transfer)." name="MEM_TRAN" value="0"/>
        <value caption="Synchronized mode (peripheral-to-memory or memory-to-peripheral transfer)." name="PER_TRAN" value="1"/>
      </value-group>
      <value-group caption="" name="XDMAC_CC0__MBSIZE">
        <value caption="The memory burst size is set to one." name="SINGLE" value="0x0"/>
        <value caption="The memory burst size is set to four." name="FOUR" value="0x1"/>
        <value caption="The memory burst size is set to eight." name="EIGHT" value="0x2"/>
        <value caption="The memory burst size is set to sixteen." name="SIXTEEN" value="0x3"/>
      </value-group>
      <value-group caption="" name="XDMAC_CC0__DSYNC">
        <value caption="Peripheral-to-memory transfer." name="PER2MEM" value="0"/>
        <value caption="Memory-to-peripheral transfer." name="MEM2PER" value="1"/>
      </value-group>
      <value-group caption="" name="XDMAC_CC0__SWREQ">
        <value caption="Hardware request line is connected to the peripheral request line." name="HWR_CONNECTED" value="0"/>
        <value caption="Software request is connected to the peripheral request line." name="SWR_CONNECTED" value="1"/>
      </value-group>
      <value-group caption="" name="XDMAC_CC0__MEMSET">
        <value caption="Memset is not activated." name="NORMAL_MODE" value="0"/>
        <value caption="Sets the block of memory pointed by DA field to the specified value. This operation is performed on 8-, 16- or 32-bit basis." name="HW_MODE" value="1"/>
      </value-group>
